k_tau_paper/BFS/openFoam/BFS_coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         400;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   50.0;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 1.0;

/*functions{
  #includeFunc wallShearStress
  
  #includeFunc graphUniform
  (
   funcName=wallShearStressGraph,
   start=(0 -0.25 0),
   end=(10 -0.25 0),
   nPoints=200,
   axis=x,
   wallShearStress
   )

#includeFunc graphUniform
  (
   funcName=wallShearStressGraph,
   start=(0 -0.25 0),
   end=(10 -0.25 0),
   nPoints=200,
   axis=x,
   wallShearStress
   )
   }*/
// ************************************************************************* //
