k_tau_paper/BFS/openFoam/BFS_coarse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
 (0.0 -0.25 0.05)//0 
 (10.0 -0.25 0.05)//1
 (-1.0 0.0 0.05)//2
 (0.0 0.0 0.05)//3
 (10.0 0.0 0.05)//4
 (-1.0 2.0 0.05)//5
 (0.0 2.0 0.05)//6
 (10.0 2.0 0.05)//7

 (0.0 -0.25 -0.05)//8
 (10.0 -0.25 -0.05)//9
 (-1.0 0.0 -0.05)//10
 (0.0 0.0 -0.05)//11
 (10.0 0.0 -0.05)//12
 (-1.0 2.0 -0.05)//13
 (0.0 2.0 -0.05)//14
 (10.0 2.0 -0.05)//15

 (0.0 -0.125 0.05)//16
 (10.0 -0.125 0.05)//17
 (-1.0 1.0 0.05)//18
 (0.0 1.0 0.05)//19
 (10.0 1.0 0.05)//20

 (0.0 -0.125 -0.05)//21
 (10.0 -0.125 -0.05)//22
 (-1.0 1.0 -0.05)//23
 (0.0 1.0 -0.05)//24
 (10.0 1.0 -0.05)//25
 );

blocks
(
 hex (0 1 9 8 16 17 22 21) (275 1 20) simpleGrading (250 1 25)
 hex (16 17 22 21 3 4 12 11) (275 1 20) simpleGrading (250 1 0.04)
 hex (3 4 12 11 19 20 25 24) (275 1 47) simpleGrading (250 1 125)
 hex (19 20 25 24 6 7 15 14) (275 1 47) simpleGrading (250 1 0.008)
 hex (2 3 11 10 18 19 24 23) (47 1 47) simpleGrading (0.008 1 125)
 hex (18 19 24 23 5 6 14 13) (47 1 47) simpleGrading (0.008 1 0.008)
 );

edges
(
 );

boundary
(
    outlet
    {
      type patch;
        faces
	  (
	   (17 1 9 22)
	   (4 17 22 12)
	   (20 4 12 25)
	   (7 20 25 15)
	   );
    }
    inlet
    {
      type patch;
        faces
	  (
	   (2 18 23 10)
	   (18 5 13 23)
	   );
    }
    lowerWall
    {
      type wall;
        faces
	  (
	   (0 8 9 1)
	   (2 10 11 3)
	   (0 16 21 8)
	   (16 3 11 21)
	   );
    }
    upperWall
    {
      type wall;
        faces
	  (
	   (14 6 7 15)
	   (13 5 6 14)
	   );
    }
    frontAndBack
    {
      type empty;
      faces
	(
	 (0 1 17 16)
	 (16 17 4 3)
	 (3 4 20 19)
	 (19 20 7 6)
	 (2 3 19 18)
	 (18 19 6 5)
	 
	 (8 21 22 9)
	 (21 11 12 22)
	 (11 24 25 12)
	 (24 14 15 25)
	 (10 23 24 11)
	 (23 13 14 24)
	 );
    }
 );

mergePatchPairs
(
 );

// ************************************************************************* //
