k_tau_paper/BFS/openFoam/BFS_coarse/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    upperWall
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }

    lowerWall
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
    
    inlet
    {
      type            timeVaryingMappedFixedValue;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
      {
	type empty;
      }
}

// ************************************************************************* //

