k_tau_paper/BFS/openFoam/BFS_coarse/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
  lowerWall
    {
      type                fixedValue;
      value               uniform 0.;
    }
  upperWall
    {
      type                fixedValue;
      value               uniform 0.;
    }
    inlet
    {
        type            timeVaryingMappedFixedValue;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
      {
	type empty;
      }
}


// ************************************************************************* //
