k_tau_paper/BFS/openFoam/BFS_coarse/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
  lowerWall
    {
      type              nutLowReWallFunction;//calculated;
      value             uniform 0.1;
    }
  upperWall
    {
      type              nutLowReWallFunction;//calculated;
      value             uniform 0.1;
    }
    inlet
    {
        type            calculated;
	value           uniform 0.1;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
      {
	type empty;
      }
}


// ************************************************************************* //
