k_tau_paper/BFS/openFoam/BFS_coarse/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
  lowerWall
    {
        type            omegaWallFunction;//fixedValue;
	value           uniform 0.0;
    }
  upperWall
    {
        type            omegaWallFunction;//fixedValue;
	value           uniform 0.0;
    }
    inlet
    {
      type            timeVaryingMappedFixedValue;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
      {
	type empty;
      }
}


// ************************************************************************* //
