k_tau_paper/BFS/openFoam/BFS_coarse/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat       csv;

sets
(
 data0
    {
        type    lineUniform;
        //axis    y;
        start   (-0.999 0 0);
        end     (-0.999 0.5 0);
        nPoints 1001;
    }
 data1
    {
        type    lineUniform;
        //axis    y;
        start   (-0.5 0 0);
        end     (-0.5 0.5 0);
        nPoints 1001;
    }
 data2
    {
        type    lineUniform;
        //axis    y;
        start   (-0.25 0 0);
        end     (-0.25 0.5 0);
        nPoints 1001;
    }
 data3
    {
        type    lineUniform;
        //axis    y;
        start   (0.0 0 0);
        end     (0.0 0.5 0);
        nPoints 1001;
    }
 data4
    {
        type    lineUniform;
        //axis    y;
        start   (0.25 -0.25 0);
        end     (0.25 0.5 0);
        nPoints 1001;
    }
 data5
    {
        type    lineUniform;
        //axis    y;
        start   (0.375 -0.25 0);
        end     (0.375 0.5 0);
        nPoints 1001;
    }
 data6
    {
        type    lineUniform;
        //axis    y;
        start   (1 -0.25 0);
        end     (1 0.5 0);
        nPoints 1001;
    }
 data7
    {
        type    lineUniform;
        //axis    y;
        start   (0.625 -0.25 0);
        end     (0.625 0.5 0);
        nPoints 1001;
    }
 data8
    {
        type    lineUniform;
        //axis    y;
        start   (0.75 -0.25 0);
        end     (0.75 0.5 0);
        nPoints 1001;
    }
 data9
    {
        type    lineUniform;
        //axis    y;
        start   (1 -0.25 0);
        end     (1 0.5 0);
        nPoints 1001;
    }
 data10
    {
        type    lineUniform;
        //axis    y;
        start   (1.25 -0.25 0);
        end     (1.25 0.5 0);
        nPoints 1001;
    }
 data11
    {
        type    lineUniform;
        //axis    y;
        start   (1.375 -0.25 0);
        end     (1.375 0.5 0);
        nPoints 1001;
    }
 data12
    {
        type    lineUniform;
        //axis    y;
        start   (1.5 -0.25 0);
        end     (1.5 0.5 0);
        nPoints 1001;
    }
 data13
    {
        type    lineUniform;
        //axis    y;
        start   (1.625 -0.25 0);
        end     (1.625 0.5 0);
        nPoints 1001;
    }
 data14
    {
        type    lineUniform;
        //axis    y;
        start   (1.75 -0.25 0);
        end     (1.75 0.5 0);
        nPoints 1001;
    }
 data15
    {
        type    lineUniform;
        //axis    y;
        start   (2 -0.25 0);
        end     (2 0.5 0);
        nPoints 1001;
    }
 data16
    {
        type    lineUniform;
        //axis    y;
        start   (2.5 -0.25 0);
        end     (2.5 0.5 0);
        nPoints 1001;
    }
 data17
    {
        type    lineUniform;
        //axis    y;
        start   (3 -0.25 0);
        end     (3 0.5 0);
        nPoints 1001;
    }
 data18
    {
        type    lineUniform;
        //axis    y;
        start   (3.5 -0.25 0);
        end     (3.5 0.5 0);
        nPoints 1001;
    }
 data19
    {
        type    lineUniform;
        //axis    y;
        start   (4 -0.25 0);
        end     (4 0.5 0);
        nPoints 1001;
    }
 data20
    {
        type    lineUniform;
        //axis    y;
        start   (5 -0.25 0);
        end     (5 0.5 0);
        nPoints 1001;
    }
 data21
    {
        type    lineUniform;
        //axis    y;
        start   (8 -0.25 0);
        end     (8 0.5 0);
        nPoints 1001;
    }
);

fields          (U k omega shearStress);

// ************************************************************************* //
